In [1]:
import pandas as pd

In [2]:
dict1={'Name':['Rahul','Sonam','Kritika','Bunny'],
       'Relation':['Myself','Partner','Sister','Brother'],
       'Age':[23,22,25,26],
       'Gender':['Male','Female','Female','Male']}
       
df=pd.DataFrame(dict1)

In [3]:
df

      Name Relation  Age  Gender
0    Rahul   Myself   23    Male
1    Sonam  Partner   22  Female
2  Kritika   Sister   25  Female
3    Bunny  Brother   26    Male

In [4]:
#1. Display Top 3 Rows OF Dataset

df.head(3)

      Name Relation  Age  Gender
0    Rahul   Myself   23    Male
1    Sonam  Partner   22  Female
2  Kritika   Sister   25  Female

In [5]:
#2.Check Last 3 Rows OF Dataset


df.tail(3)

      Name Relation  Age  Gender
1    Sonam  Partner   22  Female
2  Kritika   Sister   25  Female
3    Bunny  Brother   26    Male

In [6]:
#3 find the shape of dataset

df.shape


# here 4 rows 3 columns

(4, 4)

In [7]:
#4. Get Info about our datset

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      4 non-null      object
 1   Relation  4 non-null      object
 2   Age       4 non-null      int64
 3   Gender    4 non-null      object
dtypes: int64(1), object(3)
memory usage: 256.0+ bytes

In [8]:
#5. check null values

df.isnull().sum()

# there is no null values

Name        0
Relation    0
Age         0
Gender      0
dtype: int64

In [9]:
#6. get overall statistics about dataset

df.describe(include='all')

         Name Relation        Age Gender
count       4        4   4.000000      4
unique      4        4        NaN      2
top     Rahul   Myself        NaN   Male
freq        1        1        NaN      2
mean      NaN      NaN  24.000000    NaN
std       NaN      NaN   1.825742    NaN
min       NaN      NaN  22.000000    NaN
25%       NaN      NaN  22.750000    NaN
50%       NaN      NaN  24.000000    NaN
75%       NaN      NaN  25.250000    NaN
max       NaN      NaN  26.000000    NaN

In [10]:
# find unique values from  gender

df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [11]:
# Number of unique columns in gender

len(df['Gender'].unique())

2

In [12]:
df['Gender'].nunique()

2

In [13]:
# Display Count of unique values of gender

df['Gender'].value_counts()

Male      2
Female    2
Name: Gender, dtype: int64

In [14]:
# Find no of  people having age between 22 to 25

df[df["Age"]>=22]

      Name Relation  Age  Gender
0    Rahul   Myself   23    Male
1    Sonam  Partner   22  Female
2  Kritika   Sister   25  Female
3    Bunny  Brother   26    Male

In [15]:
len(df[(df['Age']>=22)   &   (df["Age"]<=25)])

3

In [16]:
len(df[df['Age'].between(22,25)])

3

In [17]:
# Find Average age

df['Age'].mean()

24.0

In [18]:
# Apply Method

df['Age'].apply(lambda a:a/2)

0    11.5
1    11.0
2    12.5
3    13.0
Name: Age, dtype: float64

In [19]:
df['half_Age']=df['Age'].apply(lambda a:a/2)

In [20]:
df

      Name Relation  Age  Gender  half_Age
0    Rahul   Myself   23    Male      11.5
1    Sonam  Partner   22  Female      11.0
2  Kritika   Sister   25  Female      12.5
3    Bunny  Brother   26    Male      13.0

In [21]:
# MAp Function

df['Gender'].map({'Male':0,'Female':1})

0    0
1    1
2    1
3    0
Name: Gender, dtype: int64

In [22]:
# Drop Column

df.drop('half_Age',axis=1,inplace=True)

In [23]:
# Print Name oF Columns

df.columns

Index(['Name', 'Relation', 'Age', 'Gender'], dtype='object')

In [24]:
# Sort The Data as per the Age

df.sort_values(by='Age')

      Name Relation  Age  Gender
1    Sonam  Partner   22  Female
0    Rahul   Myself   23    Male
2  Kritika   Sister   25  Female
3    Bunny  Brother   26    Male

In [25]:
df.sort_values(by='Age',ascending=False)

      Name Relation  Age  Gender
3    Bunny  Brother   26    Male
2  Kritika   Sister   25  Female
0    Rahul   Myself   23    Male
1    Sonam  Partner   22  Female

In [26]:
# Display NAme & Age of Female

df[df['Gender']=='Female'][['Name','Age']]

      Name  Age
1    Sonam   22
2  Kritika   25

In [27]:
df[df['Gender'].isin(['Female'])][['Name','Age']]

      Name  Age
1    Sonam   22
2  Kritika   25